cf_billing/Documents/энргУстановитьДиапазоныДифференцированногоТарифа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьДиапазоныДифференцированногоТарифа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргНастройкаДиапазоновДифференцированногоТарифа</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрезыДиапазонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДиапазоныДифференцированныхТарифов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Диапазон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДиапазоныДифференцированныхТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>От</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>До</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргУстановитьДиапазоныДифференцированногоТарифа/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ОсновныеРеквизиты = Новый Структура;
	ОсновныеРеквизиты.Вставить("Ссылка", Ссылка);
	ОсновныеРеквизиты.Вставить("Дата", Дата);
	ОсновныеРеквизиты.Вставить("Организация", Организация);
	ОсновныеРеквизиты.Вставить("Район", Район);
	ОсновныеРеквизиты.Вставить("Услуга", Услуга);
	
	Документы.энргУстановитьДиапазоныДифференцированногоТарифа.
		ЕстьДубликатДокумента(ОсновныеРеквизиты); 
		
	Ответственный = Пользователи.ТекущийПользователь();
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
  	
	Документы.энргУстановитьДиапазоныДифференцированногоТарифа.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	ПроверитьДиапазоны();
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДиапазоны()
	
	Ошибки = Новый Массив; 
	ТекИдентификатор = Неопределено;
	КонецДиапазона = 0;
	ТаблицаДанных = ДополнительныеСвойства.ТаблицыДвижений[0].Выгрузить();
	ТаблицаДанных.Сортировать("Услуга Возр, ВидБлагоустройства Возр, ИдентификаторСтроки Возр, От Возр");
	Для Каждого Выборка Из ТаблицаДанных Цикл 
		
		Если НЕ ТекИдентификатор = Выборка.ИдентификаторСтроки Тогда 
			КонецДиапазона = Выборка.До + 1;
			ТекИдентификатор = Выборка.ИдентификаторСтроки;
			Продолжить;
		КонецЕсли;     
		
		Если НЕ КонецДиапазона = Выборка.От Тогда
			Ошибки.Добавить(Выборка.ВидБлагоустройства);			
		КонецЕсли;
		
		Если Выборка.От >= Выборка.До Тогда
			Ошибки.Добавить(Выборка.ВидБлагоустройства);			
		КонецЕсли;
		
		КонецДиапазона = Выборка.До + 1;
		ТекИдентификатор = Выборка.ИдентификаторСтроки;
		
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда 
		
		ОбщегоНазначенияКлиентСервер.СвернутьМассив(Ошибки);
		Комментарий = "Не корректно заполнены диапазоны для видов благоустройств: " + 
		Символы.ПС + СтрСоединить(Ошибки, Символы.ПС);
		
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий;
		
	КонецЕсли;
				
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
